## Data cleaning and preparation

In [1]:
import pandas            as pd
import numpy             as np
import matplotlib.pyplot as plt

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [15]:
def f():
    return "Hello, Brother!"
string_data.fillna(method='ffill')

#string_data.fillna(method='f')

0         None
1    artichoke
2    artichoke
3      avocado
dtype: object

In [16]:
from numpy import nan as NA

dat  = [1, NA, 3.5, NA, 7]
data = pd.Series(dat)
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
data = [[1, 2, 3], [1, NA, NA], [NA, NA, NA], [NA, 6, 5]]
data

[[1, 2, 3], [1, nan, nan], [nan, nan, nan], [nan, 6, 5]]

In [23]:
df = pd.DataFrame(data)
df

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  5.0

In [24]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  NaN
3  NaN  6.0  5.0

In [25]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.184523 -0.972945  1.166317
1  0.034803  0.355509 -0.352869
2  1.024436  2.152952 -0.280802
3  0.656281 -1.560795  0.573881
4 -2.044230 -1.127789 -0.568226
5  0.153254 -1.834244  0.789102
6 -0.151862  0.993857  1.535939

In [26]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.184523       NaN       NaN
1  0.034803       NaN       NaN
2  1.024436       NaN -0.280802
3  0.656281       NaN  0.573881
4 -2.044230 -1.127789 -0.568226
5  0.153254 -1.834244  0.789102
6 -0.151862  0.993857  1.535939

In [27]:
df.dropna()

          0         1         2
4 -2.044230 -1.127789 -0.568226
5  0.153254 -1.834244  0.789102
6 -0.151862  0.993857  1.535939

In [28]:
df.dropna(thresh=2)

          0         1         2
2  1.024436       NaN -0.280802
3  0.656281       NaN  0.573881
4 -2.044230 -1.127789 -0.568226
5  0.153254 -1.834244  0.789102
6 -0.151862  0.993857  1.535939

In [29]:
df.fillna(0)

          0         1         2
0 -0.184523  0.000000  0.000000
1  0.034803  0.000000  0.000000
2  1.024436  0.000000 -0.280802
3  0.656281  0.000000  0.573881
4 -2.044230 -1.127789 -0.568226
5  0.153254 -1.834244  0.789102
6 -0.151862  0.993857  1.535939

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.184523  0.500000  0.000000
1  0.034803  0.500000  0.000000
2  1.024436  0.500000 -0.280802
3  0.656281  0.500000  0.573881
4 -2.044230 -1.127789 -0.568226
5  0.153254 -1.834244  0.789102
6 -0.151862  0.993857  1.535939

In [31]:
_ = df.fillna(0, inplace=True)

In [32]:
df

          0         1         2
0 -0.184523  0.000000  0.000000
1  0.034803  0.000000  0.000000
2  1.024436  0.000000 -0.280802
3  0.656281  0.000000  0.573881
4 -2.044230 -1.127789 -0.568226
5  0.153254 -1.834244  0.789102
6 -0.151862  0.993857  1.535939

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.865885 -0.799655  0.530805
1  0.460350 -0.281294  0.460222
2 -0.079937  0.744745  1.287046
3  0.992337 -0.962553 -2.513664
4  0.772983 -1.092469 -0.898250
5 -0.386142  1.042894 -0.871556

In [34]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0  0.865885 -0.799655  0.530805
1  0.460350 -0.281294  0.460222
2 -0.079937       NaN  1.287046
3  0.992337       NaN -2.513664
4  0.772983       NaN       NaN
5 -0.386142       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0  0.865885 -0.799655  0.530805
1  0.460350 -0.281294  0.460222
2 -0.079937 -0.281294  1.287046
3  0.992337 -0.281294 -2.513664
4  0.772983 -0.281294 -2.513664
5 -0.386142 -0.281294 -2.513664

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.865885 -0.799655  0.530805
1  0.460350 -0.281294  0.460222
2 -0.079937 -0.281294  1.287046
3  0.992337 -0.281294 -2.513664
4  0.772983       NaN -2.513664
5 -0.386142       NaN -2.513664

In [38]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [39]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [42]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [43]:
data['v1'] = range(7)

In [44]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [45]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [50]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [51]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [53]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [54]:
dat = np.arange(12).reshape((3, 4))
ind = ['Ohio', 'Colarado', 'New York']
col = ['one', 'two', 'three', 'four']

data = pd.DataFrame(dat, index=ind, columns=col)
data

          one  two  three  four
Ohio        0    1      2     3
Colarado    4    5      6     7
New York    8    9     10    11

In [55]:
transform = lambda x: x[:4].upper()

In [56]:
data.index.map(transform)

Index(['OHIO', 'COLA', 'NEW '], dtype='object')

In [57]:
data

          one  two  three  four
Ohio        0    1      2     3
Colarado    4    5      6     7
New York    8    9     10    11

In [58]:
data.index = data.index.map(transform)

In [59]:
data

      one  two  three  four
OHIO    0    1      2     3
COLA    4    5      6     7
NEW     8    9     10    11

In [60]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [61]:
bins = [18, 25, 35,  60, 100]

In [62]:
cats = pd.cut(ages, bins)

In [63]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [65]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [66]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [68]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [69]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025452     0.032708    -0.047606     0.007006
std       0.986265     1.009223     1.016786     0.991265
min      -2.829163    -3.376097    -3.146795    -3.541427
25%      -0.762150    -0.643937    -0.729757    -0.643935
50%      -0.022521     0.068697    -0.034202    -0.008344
75%       0.617478     0.654225     0.639356     0.675592
max       3.239263     3.571674     3.081887     2.944494

In [70]:
col = data[2]
col[np.abs(col) > 3]

603   -3.146795
610    3.081887
Name: 2, dtype: float64

In [71]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
103  3.239263  0.181378  0.520906 -0.649280
202 -1.267934  3.571674 -0.384541  1.385511
238  0.987171 -3.376097  0.137145 -1.329813
387  1.168278  1.924038 -0.428484 -3.292331
392  0.288123  3.316900 -0.532847 -0.357814
566  0.205783  1.345641 -0.226288 -3.541427
603  0.002721  0.431373 -3.146795 -1.053391
610 -1.150872  0.092005  3.081887 -0.543874
782 -0.305364  3.086992 -1.213020 -0.278844

In [ ]:
#Permutations

In [72]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [73]:
sampler = np.random.permutation(5)
sampler

array([4, 1, 0, 3, 2])

In [74]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [75]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7

In [76]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [77]:
draws = choices.sample(n=10, replace=True)
draws

1    7
0    5
3    6
2   -1
0    5
0    5
2   -1
3    6
3    6
4    4
dtype: int64

In [80]:
dat = {'key': ['b', 'b', 'a', 'c', 'a', 'b'],
       'data1': range(6)}
df = pd.DataFrame(dat)

In [81]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [82]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [83]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [84]:
val = 'a, b, guido'
val.split(',')

['a', ' b', ' guido']

In [85]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [86]:
first, second, third = pieces
delimiter = '::'
first + delimiter + second + delimiter + third

'a::b::guido'

In [87]:
delimiter.join(pieces)

'a::b::guido'

In [88]:
'guido' in val

True